import { 求公元年份干支 } from 'src/constant/ganzhi'

test('公元一年对应 汉平帝 元始元年 辛酉年', () => {
  expect(求公元年份干支(1)).toEqual('辛酉')
})

test('公元四年对应 汉平帝 元始四年 甲子年', () => {
  expect(求公元年份干支(4)).toEqual('甲子')
})

test('公元一八四年对应 汉灵帝 中平四年 甲子年', () => {
  expect(求公元年份干支(184)).toEqual('甲子')
})

test('公元一〇八二年年对应 北宋元丰五年 壬戌年', () => {
  expect(求公元年份干支(1082)).toEqual('壬戌')
})

test('公元一九四九年对应 新中国元年 己丑年', () => {
  expect(求公元年份干支(1949)).toEqual('己丑')
})

test('公元二〇二五对应  乙巳年', () => {
  expect(求公元年份干支(2025)).toEqual('乙巳')
})
