enum 阳干 {
  甲 = '甲',
  丙 = '丙',
  戊 = '戊',
  庚 = '庚',
  壬 = '壬',
}

enum 阴干 {
  乙 = '乙',
  丁 = '丁',
  己 = '己',
  辛 = '辛',
  癸 = '癸',
}

enum 阳支 {
  子 = '子',
  辰 = '辰',
  寅 = '寅',
  午 = '午',
  戌 = '戌',
  申 = '申',
}

enum 阴支 {
  丑 = '丑',
  卯 = '卯',
  巳 = '巳',
  未 = '未',
  酉 = '酉',
  亥 = '亥',
}

const 天干 = { ...阳干, ...阴干 } as const
type 天干 = keyof typeof 天干
const 地支 = { ...阳支, ...阴支 } as const
type 地支 = keyof typeof 地支

type 干支 = `${阳干}${阳支}` | `${阴干}${阴支}`

const 公元除余映射天干: Record<number, 天干> = {
  4: 天干.甲,
  5: 天干.乙,
  6: 天干.丙,
  7: 天干.丁,
  8: 天干.戊,
  9: 天干.己,
  0: 天干.庚,
  1: 天干.辛,
  2: 天干.壬,
  3: 天干.癸,
}

const 公元除余映射地支: Record<number, 地支> = {
  4: 地支.子,
  5: 地支.丑,
  6: 地支.寅,
  7: 地支.卯,
  8: 地支.辰,
  9: 地支.巳,
  10: 地支.午,
  11: 地支.未,
  0: 地支.申,
  1: 地支.酉,
  2: 地支.戌,
  3: 地支.亥,
}

export const 求公元年份干支 = (年: number): 干支 => {
  const 天干 = 公元除余映射天干[年 % 10]
  const 地支 = 公元除余映射地支[年 % 12]
  return `${天干}${地支}` as 干支
}
