enum 节 {
  立春 = '立春',
  惊蛰 = '惊蛰',
  清明 = '清明',
  立夏 = '立夏',
  芒种 = '芒种',
  小暑 = '小暑',
  立秋 = '立秋',
  白露 = '白露',
  寒露 = '寒露',
  立冬 = '立冬',
  大雪 = '大雪',
  小寒 = '小寒',
}

enum 气 {
  雨水 = '雨水',
  春分 = '春分',
  谷雨 = '谷雨',
  小满 = '小满',
  夏至 = '夏至',
  大暑 = '大暑',
  处暑 = '处暑',
  秋分 = '秋分',
  霜降 = '霜降',
  小雪 = '小雪',
  冬至 = '冬至',
  大寒 = '大寒',
}

export const 节气 = {
  ...节,
  ...气,
} as const

export type 节气 = keyof typeof 节气

const 节气序号 = {
  [节气.立春]: 0,
  [节气.雨水]: 1,
  [节气.惊蛰]: 2,
  [节气.春分]: 3,
  [节气.清明]: 4,
  [节气.谷雨]: 5,
  [节气.立夏]: 6,
  [节气.小满]: 7,
  [节气.芒种]: 8,
  [节气.夏至]: 9,
  [节气.小暑]: 10,
  [节气.大暑]: 11,
  [节气.立秋]: 12,
  [节气.处暑]: 13,
  [节气.白露]: 14,
  [节气.秋分]: 15,
  [节气.寒露]: 16,
  [节气.霜降]: 17,
  [节气.立冬]: 18,
  [节气.小雪]: 19,
  [节气.大雪]: 20,
  [节气.冬至]: 21,
  [节气.小寒]: 22,
  [节气.大寒]: 23,
}

export const 获取节气月偏移 = (指定节气: 节气): number => {
  return Math.floor(节气序号[指定节气] / 2)
}
